#-------------------------------------------------------------------------------
# -*- coding: utf-8 -*-
# Pearls in the box: 白真珠を引く確率を求めよ。
#
# 【ルール】
# 箱に黒と白の真珠を、どちらも任意の数だけ入れる。
# 箱は内部で指定された回数だけ真珠を選択する仕組みとなっていて、
# 選ばれた真珠は違う色の真珠に変わる。
# 入れ替わる回数はN-1回とする。
#
# 【入力】
# S1S2S3...Si N     最初に投入される真珠と、選択される回数
#
#   ただし、Sj = "b" or "w"
#
# 【出力】
# N-1回入れ替えたあと、N回目に白色が選ばれる確率を出力せよ。
# 小数第2位以上で出力せよ。
#
#-------------------------------------------------------------------------------

# 【方針】
# その文字列が得られる確率と文字列が組になったリストを作成、
# そのリスト作成をN-1回繰り返す。
# そして最後にN回目に白が選ばれる確率を求めれば良い。・・・と思う。



a = 0

if a== 0:

    pearls =
    N =





