#-------------------------------------------------------------------------------
# -*- coding: utf-8 -*-
# 株式会社モルフォ　新卒採用チャレンジ問題No.7
# http://www.morphoinc.com/careers/challengeTest_7.html
# 与えられた座標によって立方体が作成できるか、判定せよ。
#
# 【ルール】
# 6つの座標が与えられる。
# それぞれの座標を中心とする面を作成した時、
# 立方体の展開図となっているかどうかを判定する。
#
# 【入力】
# x0 y0 x1 y1 x2 y2 x3 y3 x4 y4 x5 y5　点0番～点5番までの各座標
#
# 【出力】
# 立方体の展開図になっていれば1、そうでなければ0を出力せよ。
#
# 【例題と回答】
# x0　　y0　　x1　　y1　　x2　　y2　　x3　　y3　　x4　　y4　　x5　　y5　　　出力
# 0　　　0　　-1　 　1　　-2　 　1　 　1　　 0　　-1　 　0　 　0　　-1　　　　1
# 1　 　-1 　　2　 　0　 　1　 　0　 　0 　　0　 　3　 　0　 　0　 　1　　　　1
# 2　 　-2 　　0 　　2　　-2　 　0　 　0　 　0　 　2　 　0　 　4　 　0　　　　0
# 0　　　0　 　0　 　1　　-1　 　0　 　0　　-2　　 0　　-1　　-2　　 0　　　　0
# -1　　-2　　-1　　 0　　 0　　-2　　 0　　-1　　-2　　-2　　 0　　 0　　　　0
# 3　　　0　　 0　　-9　　 0　　 0　　-3　　 0　　 0　　-3　　 0　　-6　　　　1
# 9　　　0　　11　　-1　　10　　 0　　 8　　 0　　12　　-1　　10　　-1　　　　1
# -12　　1　 -14　　 2　　-9　　 2　 -10　　 0　 -10　　 5　 -11　　 3　　　　0
#
#-------------------------------------------------------------------------------

def main():
    pass

if __name__ == '__main__':
    main()
